app/controllers/entries_controller.rb

  def create
    @entry = Entry.new(entry_params)

    respond_to do |format|
      if @entry.save
---
INSERT INTO "entries" ("text", "image", "thumbnail", "title", "day", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @entry.update(entry_params)
---
UPDATE "entries" SET "image" = ?, "thumbnail" = ?, "updated_at" = ? WHERE "entries"."id" = ?  [["image", "https://michaelman.net/rewind/images/3_full.jpeg"], ["thumbnail", "https://michaelman.net/rewind/images/3_thumb.jpeg"], ["updated_at", "2018-12-27 05:30:03.676585"], ["id", 5]]