app/controllers/home_controller.rb

  def index
  	@entries = Entry.order(day: :asc)
---
SELECT "entries".* FROM "entries" ORDER BY "entries"."day" ASC